x = int(input())

# DP 테이블 초기화
d = [0] * 30001

# 보텀업 DP 진행
for i in range(2, x + 1):
    # 현재의 수에서 1을 빼는 경우
    d[i] = d[i - 1] + 1
    # 현재의 수가 2로 나누어 떨어지는 경우
    if i % 2 == 0:
        d[i] = min(d[i], d[i // 2] + 1)
    # 현재의 수가 3으로 나누어 떨어지는 경우
    if i % 3 == 0:
        d[i] = min(d[i], d[i // 3] + 1)
    if i % 5 == 0:
        d[i] = min(d[i], d[i // 5] + 1)
    
print(d[x])

# d[i // 2]는 "i를 2로 나누어서 나온 숫자가 1이 되기까지 걸린 최소 연산 횟수"를 이미 알고 있습니다.
# 그런데 i를 2로 나누는 연산을 추가로 한 번 더 했으니, 그 연산을 계산에 포함시켜야 합니다.
# 그래서 + 1을 추가합니다.