# 인접 리스트(Adjacency List): 리스트로 그래프의 연결 관계를 표현하는 방식
# - 모든 노드에 연결된 노드에 대한 정보를 차례대로 연결하여 저장

# 행(Row)이 3개인 2차원 리스트로 인접 리스트 표현
graph = [[] for _ in range(3)]

# 0번 노드에 연결된 노드 정보 저장(노드 번호, 거리)
graph[0].append((1, 7))
graph[0].append((2, 5))

# 1번 노드에 연결된 노드 정보 저장
graph[1].append((0, 7))

# 2번 노드에 연결된 노드 정보 저장
graph[2].append((0, 5))

print(graph)

# 출력 결과:
# print_arr = [
#     [(1, 7), (2, 5)], # 0번 노드에 연결된 노드 정보(노드 번호, 거리)
#     [(0, 7)],         # 1번 노드에 연결된 노드 정보(노드 번호, 거리)
#     [(0, 5)]          # 2번 노드에 연결된 노드 정보(노드 번호, 거리)
# ]