# 공백을 포함한 전체 입력이 하나의 문자열로 저장
data_1 = input("1번: ")
print(data_1)
# 입력: 1 2 3
# 출력: "1 2 3"

# 공백 기준으로 나뉘어 각 요소가 문자열로 리스트에 저장
data_2 = input("2번: ").split()
print(data_2)
# 입력: 1 2 3
# 출력: ['1', '2', '3']

# 사용자가 입력한 문자열을 하나씩 순회하여 각 문자를 정수로 변환
# 문자열 전체를 하나의 숫자가 아니라, 개별 문자를 숫자로 변환
data_3 = list(map(int, input("3번: ")))
print(data_3)
# 입력: 123
# 출력: [1, 2, 3]

# 사용자가 입력한 문자열을 공백 기준으로 나눈 후, 각 요소를 정수로 변환
data_4 = list(map(int, input("4번: ").split()))
print(data_4)
# 입력: 1 2 3
# 출력: [1, 2, 3]

# 언패킹(Unpacking)
n, m = map(int, input("n, m: ").split())
print(n, m)
# map 객체는 이터레이터이기 때문에, map 객체에서 값을 바로 꺼낼 수 있습니다. 이 과정은 리스트나 튜플로 변환하지 않아도 동작합니다.
# map 객체를 반환하지만, 언패킹을 통해 값을 변수에 직접 할당할 수 있습니다.
# Python은 자동으로 map 객체에서 값을 하나씩 꺼내 변수에 할당해 줍니다.
# 변수의 개수와 map 객체의 요소 개수가 일치해야 합니다.